OpenFOAM-v1812/tutorials/IO/systemCall/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication decomposePar

#- For parallel running: set the initial fields
restore0Dir -processor

runParallel $(getApplication)

#------------------------------------------------------------------------------
